{
  "slug": "competences",
  "title": "Mes compétences",
  "content": {
    "articles": [
      {
        "title": "Développer un site web",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Développer un site web",
          "image": {
            "src": "https://voila-le-travail.fr/wp-content/uploads/2022/07/Comment-monter-en-compe%CC%81tences-dans-son-travail.png",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "Le développement web a pris une place importante dans notre société. En effet, depuis les débuts d’internet, les technologies numériques n’ont cessé de croitre. D’énormes progrès ont été effectué, et encore aujourd’hui les technologies évoluent à une vitesse exponentielle. Ces technologies sont utilisées constamment au quotidien dans le monde entier. Que ce soit sur les smartphones ou sur les ordinateurs, les sites web sont partout, car ils sont conçus et adapté pour un maximum de supports utilisateurs. De plus, les sites web constituent un véritable business. Ces derniers permettent à de nombreuses sociétés de développer leurs activités, que ce soit dans la production, la vente et la communication.Aujourd’hui, de nombreux entrepreneurs se lance dans la création d’une entreprise. Prenons comme exemple un jeune diplômé sortant d’école qui souhaite lancer un business dans la vente de vêtements. Il va d’abord trouver des personnes avec qui s’associer pour lancer cette activité, puis chaque associé va proposer ses idées. Tous ensemble ils vont construire leur identité. Ensuite, pour rendre le projet public, ils vont avoir besoin d’une certaine présence numérique. Ça peut se faire via les réseaux sociaux, ou via un site web, comme le font de nombreuses grandes entreprises ! C’est pourquoi cette compétence a une place importante au sein de l’entreprise. Utilisé à bon escient, elle pourrait grandement participer à l’accroissement du chiffre d’affaires d’une entreprise. Certaines activités requièrent d’avoir une forte emprunte numérique afin de faire monter les chiffres, et le web est une solution très efficace pour cela.",
            "customCss": {
            }
          },
          {
            "title": "Quelques situations concrètes",
            "direction": "row",
            "elements": [
              {
                "type": "text",
                "sort": 1,
                "content": "Dans le cadre de mon alternance, j’ai eu l’occasion de travailler sur plusieurs projets web.-\t Un « CMS » permettant de générer des site web (Wordpress), destiné à une entreprise multinationale (business b2b). -\tUne plateforme web de comptabilité pour entreprises.-\tUne plateforme de crowdfunding immobilière développé par un ancien employé. Le code source étant assez vieux, j’ai eu à migrer une bonne partie de cette dernière afin de la rendre plus maintenable.Mon regard critique sur mon niveau d’expertiseLe domaine du web évolue constamment, et malgré mon apprentissage continue, j’ai encore tant de choses à apprendre. De plus, il est très facile d’écrire du code sale, mais concevoir un site web très bien structuré doté d’une architecture facilitant son maintien et son évolution, c’est tout un autre niveau d’expertise. Aujourd’hui, je ne me considère pas être un pur car cela demande énormément d’expérience. C’est ce qui va différencier le bon développeur du mauvais développeur lors des entretiens techniques.  D’ailleurs, il est assez facile d’identifier le bon développeur et le mauvais lors d’un entretien. Le bon développeur va plus loin qu’écrire du code. Il sait être créatif, va tenter d’imaginer les meilleures solutions, et se questionnera sur ses propres choix, tandis que le mauvais développeur va apporter une solution sans la questionner et la remettre en question. Enfin, un développeur se doit d’être doté d’une très bonne logique et être capable de résoudre des problèmes. Il existe deux catégories de développeurs aujourd’hui. Il y a les développeurs spécialisés dans une technologie spécifique, et les développeurs polyvalents. Mon objectif personnel est d’être un développeur polyvalent. J’aimerai pouvoir m’adapter dans n’importe quel environnement, peu importe les langages de programmation imposés et faire face à tout type de problème. Je travaille cela chaque jour, et selon moi ce serait à la fois une satisfaction et un accomplissement personnel.",
                "customCss": {
                }
              }
            ]
          }
        ]
      },
      {
        "title": "Définir une architecture adaptée pour un logiciel afin de le rendre stable, évoluable et maintenable.",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Définir une architecture adaptée pour un logiciel afin de le rendre stable, évoluable et maintenable.",
          "image": {
            "src": "https://www.dragon1.com/images/background99.jpg",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>Dans le paysage en constante évolution du développement logiciel, la compétence technique de définir une architecture backend adaptée joue un rôle essentiel dans la création de solutions logicielles durables. L'architecture backend est la fondation sur laquelle repose tout le système, déterminant sa stabilité, sa capacité à évoluer avec les besoins changeants et sa facilité de maintenance.</p><br><h1>Stabilité, la première pierre angulaire </h1><p>La stabilité est cruciale pour tout logiciel en production. Une architecture backend bien conçue doit garantir la fiabilité du système en minimisant les temps d'arrêt, les bugs et les performances dégradées. Cela implique le choix judicieux des technologies, la mise en œuvre de bonnes pratiques de développement et la prise en compte des aspects liés à la sécurité.L'utilisation de frameworks robustes, la mise en place de tests automatisés approfondis et l'intégration continue sont des éléments clés pour assurer la stabilité du backend. La conception orientée microservices est un modèle architectural qui favorise la stabilité en décomposant l'application en composants indépendants, minimisant ainsi l'impact d'un échec sur l'ensemble du système. Pour donner un exemple concret, durant mes études à l’INTECH, il nous a été demandé, par groupe, de développer un site web de réservation de billets d’avion en ligne. Ce site web devait à minima afficher une liste de vols d’avions, une barre de recherche pour filtrer les vols, ainsi que permettre à l’utilisateur de faire des réservations.Pour procéder, nous avons commencé à développer la partie backend du site en suivant le modèle MVC pour pouvoir structurer la donnée, mettre en place des contrôleurs qui vont interagir avec ces données, et enfin envoyer la données au frontend. En suivant ce modèle, nous avons mis à disposition au frontend l’ensemble des endpoints API pour obtenir des vols d’avions et faire des réservations. Chaque vol d’avion était stocké dans une base de données MySQL.Néanmoins, il nous a été demandé de remettre en cause l’architecture du code de notre application et d'identifier le risque qui se présentait face à une telle architecture. Nous nous sommes rendus compte que notre application était exposée à un risque majeur : le downtime général. Ce que j’entend par “downtime général”, c’est que si jamais la machine hébergeant le code, venait à tomber en panne, alors l’entièreté du backend tomberait en panne. De plus, si une partie du code venait à comporter un bug, alors toute l’application serait compromise. C’est à ce moment qu’on a décidé d’introduire au sein de notre application une notion bien connue en 2023 : les microservices.</p><div class='blog-img-wrapper'><img class='blog-img' src='/img/microservices-vs-monolithic.png'></div><p>L’architecture microservices consiste à découper notre application en plusieurs petits services, chaque service ayant une seule et unique responsabilité au sein de notre programme. Chaque service tourne indépendamment comme serveurs individuels, dont le code peut tourner sur une seule machine ou sur plusieurs machines différentes. L’application pourra alors interagir avec ces services via des requêtes HTTP. Si un seul service devait tomber en panne, alors cela n'impactent pas les autres dans la mesure où chaque service est isolé.De ce fait, pour notre application, nous l’avons découpé de la manière suivante :</p><div class='blog-img-wrapper'><img class='blog-img' src='/img/schema-architecture-app.png'></div><p>Notre application est désormais constitué de 3 services : </p><ul><li>Un moteur de réservation de vols</li><li>Un service qui retourne des vols d’avions</li><li>Une service agissant comme interface pouvant interagir directement avec la base de donnée</li></ul><p>Si le moteur de réservation venait à tomber en panne, cela n'empêchera pas les utilisateurs de consulter les vols d’avions sur le site. Néanmoins, ils devront être prévenus qu’il n’est pas possible de réserver des avions. Si la base de données tombait, alors le service d’exposition de vols pourrait quand même afficher des vols d’avions grâce à un système de cache qui garde en mémoire des vols d’avions et qui se rafraîchit si les informations de vols venaient à être mis à jour.En conclusion, nous venons de concevoir un système faiblement couplé où chaque service peut fonctionner de manière indépendante sans que l’interruption de l’un, fasse le malheur des autres.</p><br><h1>Scalabilité Verticale et Horizontale : Garants de la Stabilité et de la Pérennité</h1><p>Dans le développement de notre site de réservation de billets d'avion à l'INTECH, l'introduction de l'architecture microservices a été une étape cruciale pour améliorer la stabilité et la pérennité de notre application. Cependant, notre démarche ne s'est pas limitée à une simple répartition des responsabilités entre différents services. Elle a également jeté les bases pour une scalabilité tant verticale qu'horizontale, des éléments essentiels pour anticiper la croissance future et garantir une expérience utilisateur sans faille.</p><br><h1>Scalabilité Verticale : Adapter les Ressources pour la Croissance</h1><p>La scalabilité verticale, ou \"upscaling\", consiste à augmenter la capacité d'une ressource existante, généralement en renforçant la puissance d'une machine serveur. Dans notre cas, chaque service individuel au sein de notre architecture microservices peut être adapté indépendamment en fonction de ses besoins spécifiques. Par exemple, si le moteur de réservation de vols commence à subir une charge importante, nous pouvons augmenter la puissance de la machine hébergeant ce service particulier. De même, si le service de retour des vols d'avions nécessite plus de ressources, il peut être ajusté de manière isolée.Cette flexibilité verticale nous permet d'optimiser chaque composant du système en fonction de ses besoins spécifiques, contribuant ainsi à une utilisation plus efficace des ressources et à une réponse adaptative aux variations de la demande.</p><br><h1>Scalabilité Horizontale : Répartir la Charge pour une Performance Optimale</h1><p>La scalabilité horizontale, ou \"outscaling\", va au-delà de l'adaptation des ressources existantes en ajoutant simplement de nouvelles instances du même service. Dans notre architecture microservices, chaque service peut être répliqué sur plusieurs machines distinctes, permettant une distribution équilibrée de la charge.Prenons l'exemple du service qui retourne des vols d'avions. Si la demande augmente de manière significative, plutôt que de renforcer une seule instance de ce service, nous pouvons déployer plusieurs copies de ce service sur différentes machines. Cela garantit une répartition égale de la charge, évitant les goulots d'étranglement et assurant une réponse rapide aux requêtes des utilisateurs.</p><br><h1>Lien avec la Stabilité et la Pérennité</h1>En adoptant une approche combinée de scalabilité verticale et horizontale au sein de notre architecture microservices, nous renforçons non seulement la capacité de notre application à gérer des charges variables, mais nous nous protégeons également contre les pannes potentielles.En cas de pic de trafic, la scalabilité horizontale permet à notre application de s'étendre de manière transparente, garantissant une expérience utilisateur fluide. De plus, la scalabilité verticale nous offre la possibilité d'ajuster finement les ressources pour répondre aux besoins spécifiques de chaque service, optimisant ainsi les performances globales.En conclusion, la mise en œuvre de la scalabilité verticale et horizontale dans le cadre d'une architecture microservices n'est pas seulement une question de gestion de la charge, mais une stratégie globale visant à renforcer la stabilité, la réactivité et la pérennité de notre logiciel de réservation de billets d'avion. En adoptant ces principes, nous créons un écosystème robuste, capable de prospérer dans un environnement en constante évolution.",
            "customCss": {
            }
          }
        ]
      },
      {
        "title": "Implémenter un logiciel de qualité, en choisissant des structures de données adaptées et des algorithmes pertinents afin d’assurer la robustesse du logiciel.",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Implémenter un logiciel de qualité, en choisissant des structures de données adaptées et des algorithmes pertinents afin d’assurer la robustesse du logiciel.",
          "image": {
            "src": "https://www.springboard.com/blog/wp-content/uploads/2022/09/software-engineers-role.jpg",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>Lorsque l'on développe un logiciel, il est essentiel de veiller à ce qu'il soit de qualité, robuste et fiable. Pour ce faire, l'implémentation du logiciel doit être effectuée en choisissant des structures de données adaptées et des algorithmes pertinents. Cette compétence est cruciale pour garantir que le logiciel fonctionne correctement, qu'il est performant et qu'il peut répondre aux besoins des utilisateurs.</p><h1>Qu’est ce qu’une structure de donnée ?</h1><p>Une structure de donnée est une manière de stocker une information dans la mémoire vive d’un ordinateur dans l’objectif de la traiter plus facilement. Il existe plusieurs structures de données. </p><h2>Les tableaux</h2><p>Le tableau est la structure de donnée la plus courante, et est enseigné dans toutes les écoles pour les débutants. Dans un tableau, chaque élément est indexé, c’est-à-dire qu’on affecte à chaque donnée un numéro permettant au programme d’y accéder. Ensuite, chaque élément est placé de façon contiguë dans la mémoire.<div class='blog-img-wrapper'><img class='blog-img' src='/img/tableau_standard.png'/></div></p><h2>La liste chaînée</h2><p>Une liste chainée est une structure de donnée permettant de stocker des données de façon linéaire, tout comme le tableau. Une liste est composée de plusieurs nœud. Chaque nœud stocke une information particulière (un entier, une chaine de caractère etc…), ainsi qu’un lien vers un autre nœud.<div class='blog-img-wrapper'><img class='blog-img' src='/img/liste_chainee.png'></div> Il y a plusieurs différences entre un tableau et une liste chainée. Dans un tableau, on ne peut stocker qu’un seul type de donnée. Par exemple, si l’on souhaite ajouter une nouvelle donnée dans un tableau stockant que des entiers, notre donnée devra obligatoirement être un entier. Dans une liste chainée, on peut stocker tout type de données (des entiers, des nombres flottants, des chaines de caractères, des listes, des tableaux etc…).<br>De plus, dans un tableau traditionnel, chaque élément est stocké côté à côté en mémoire, tandis que dans une liste chainée, chaque élément est stocké à des endroits libres, sélectionnés par le système d’exploitation.</p><div class='blog-img-wrapper'><img class='blog-img' src='/img/representation_liste_chainee.png'>Figure 1: Representation d'UNE LISTE CHAINÉE EN MEMOIRE</div><br><br><div class='blog-img-wrapper'><img class='blog-img' src='/img/representation_tableau.jpg'>Figure 2: REPRESENTATION D'UN TABLEAU EN MÉMOIRE</div><br><p>De plus, il est plus simple d’effectuer des opérations d’insertion et de suppression d’élément dans une liste chainée. Pour supprimer un élément “A” dans une liste, il suffit de parcourir la liste à partir de la tête de liste jusqu’à tomber sur l’élément précédant “A”, puis remplacer le lien partant de l’élément précédant A vers A par un lien vers l’élément situé après A. <br>Dans un tableau traditionnel, une fois l’élément supprimé on doit décaler tous les éléments le suivant, vers la gauche pour combler le trou crée par la suppression, ce qui demande du travail supplémentaire pour l’ordinateur.</p><h1>Comment mesure-t-on l’efficacité d’un programme informatique ?</h1><p>Un informaticien sera constamment amené à se poser des questions sur l’efficacité de son programme informatique. On pourrait dire que l’efficacité d’un programme informatique se mesure en observant le temps qu’il met à arriver à terme de son exécution. Cependant, cette hypothese est biaisé.<br>Prenons un exemple concret. <br>Bob, un élève étudiant en 1ere école d’ingénieur, a pour exercice d’écrire deux programmes informatique distinct, A et B, qui doivent trier dans l’ordre croissant un tableau traditionnel contenant 10 nombres entiers. Bob doit utiliser deux approches différentes pour trier un tableau d’entiers, d’où le besoin d’écrire deux programmes séparés.<br>A et B trient leur tableau en suivant un algorithme particulier. On part du principe que l’algorithme qu’A va suivre est théoriquement jugé comme moins efficace que l’algorithme que B suit. <br>Bob veut s’assurer que le programme A sera plus lent que le programme B. <br> Bob utilise un chronomètre et effectue plusieurs experimentations. Il constate qu’à certains essais, A prend plus de temps que B, et dans d’autres cas, B prend plus de temps. Bob ne comprend pas...<br>En effet, il n’est pas viable de mesurer l’efficacité d’un programme informatique à partir du temps qu’il a pris pour arriver à terme, car il y a beaucoup de facteurs qui entrent en compte et viennent biaiser les résultats comme : <br>Les performances du processeur<br>Les échanges chimiques et thermiques se produisant au niveau des circuits electrique qui viennent créer des perturbations<br>Et bien d’autres.. <br>Pour cela, il n’est pas judicieux de mesurer l’efficacité d’un programme informatique par la temps qu'il prend, mais plutôt en quantité d’opération qu’il va effectuer pendant tout le cycle de vie de ce dernier.<br>Pour résumer toute cette partie, lorsqu'on parle de structures de données adaptées, cela signifie que le choix des structures de données doit être effectué en fonction des besoins du logiciel. De plus, ce choix doit être fait en prenant en compte la quantité des données, ainsi que la variation de la quantité de donné qu’on va stocker, si cette quantité est amené à augmenter au fil du temps ou non.</p><h1>Le choix des algorithmes</h1><p>De même, le choix des algorithmes est tout aussi important. Les algorithmes pertinents doivent être choisis pour garantir que le logiciel fonctionne correctement, qu'il est rapide et efficace. <br>Il est également important de veiller à la robustesse du logiciel. Cela signifie qu'il doit être capable de gérer les erreurs et les exceptions de manière appropriée, de sorte qu'il puisse continuer à fonctionner même en cas d'erreurs ou de pannes. Pour cela, des techniques de gestion des erreurs et de gestion des exceptions doivent être mises en place.<br>En fin de compte, l'implémentation d'un logiciel de qualité nécessite de choisir des structures de données adaptées et des algorithmes pertinents pour garantir la robustesse du logiciel. Cela permet de garantir que le logiciel fonctionne correctement, qu'il est performant et qu'il peut répondre aux besoins des utilisateurs. La compétence pour implémenter un tel logiciel est donc essentielle pour tout développeur de logiciel.</p>",
            "customCss": {
            }
          }
        ]
      },
      {
        "title": "L'adaptabilité",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "L'adaptabilité",
          "image": {
            "src": "https://solutionsandco.com/images/easyblog_articles/297/b2ap3_large_shutterstock_209179201.jpg",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>Au commencement de mon stage chez Xo7, j'ai rapidement constaté que la compétence transversale cruciale de l'adaptabilité était un pilier essentiel au sein de l'entreprise. Même si j'avais mis de côté le langage PHP pendant trois ans, je n'ai pas éprouvé de difficultés majeures à me réacclimater à ses subtilités techniques. L'atmosphère dynamique de Xo7, combinée à une équipe collaborative et à des ressources de formation approfondies, a grandement facilité ma transition. Cette expérience a renforcé ma conviction quant à l'importance de l'adaptabilité dans le contexte professionnel, soulignant la nécessité de rester ouvert aux changements et de s'ajuster rapidement aux évolutions technologiques. Ces premiers jours chez Xo7 ont ainsi été une démonstration concrète de la pertinence de cette compétence transversale, confirmant qu'elle constitue un atout indispensable pour prospérer dans un environnement d'entreprise en constante évolution.</p><p>De surcroît, la facilité avec laquelle je me suis adapté aux technologies chez Xo7 découle également de ma démarche de ne jamais me spécialiser exclusivement dans quelques technologies spécifiques. Mon approche a toujours consisté à utiliser les langages de programmation de manière stratégique pour acquérir des notions, des concepts et des paradigmes de programmation plutôt que de m'en tenir uniquement à l'apprentissage de la syntaxe. Cette polyvalence m'a offert une base solide et m'a permis d'aborder de nouveaux défis technologiques avec confiance. L'aptitude à comprendre les principes fondamentaux au-delà des langages individuels a été un atout majeur dans ma capacité à m'adapter rapidement aux exigences spécifiques du langage PHP chez Xo7, soulignant ainsi la valeur de cette approche dans un monde professionnel en constante mutation.</p>",
            "customCss": {
            }
          }
        ]
      },
      {
        "title": "Capacité à resoudre des problèmes",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Capacité à resoudre des problèmes",
          "image": {
            "src": "https://it-solutions.center/wp-content/uploads/2022/02/problem-solving-diagram-question-marks-brain-lightbulb-to-illustrate-problems-solutions-43014958.jpg",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>Avant d'entamer ma première expérience au sein de l'entreprise Xo7, j'ai consacré un temps considérable à affiner ma capacité à résoudre des problèmes complexes. Mon terrain d'entraînement de prédilection était le site web Codewars, une plateforme offrant une multitude de défis algorithmiques couvrant divers domaines tels que les mathématiques, la cryptographie et les structures de données. Cette préparation intensive a rapidement porté ses fruits lorsque j'ai fait mes premiers pas chez Xo7, où j'ai su m'adapter rapidement aux technologies et aux outils utilisés. Mon approche originale face à chaque problème a été remarquée, ce qui m'a valu des éloges pour ma perspicacité.</p><p>En conséquence, on m'a rapidement confié la responsabilité de travailler de manière autonome sur deux produits numériques distincts, chacun dédié à un client spécifique. Cette évolution rapide vers des missions plus indépendantes a été une validation tangible de ma capacité à résoudre des problèmes de manière efficace et créative. J'ai très vite compris que cette habitude à confronter le cerveau à des problèmes difficiles entraine l'esprit à résoudre des défis complexes, chose qui est indispensable pour un developpeur.</p>",
            "customCss": {
            }
          }
        ]
      }, 
      {
        "title": "Communication",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Communication",
          "image": {
            "src": "/img/communication.png",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>En débutant ma carrière professionnelle chez Xo7, j'ai rapidement constaté le défi supplémentaire que représentait ma nature introvertie, accentuée par une habitude acquise au fil des années d'apprentissage en autodidacte dans le domaine informatique. Les développeurs, en raison de leur propension naturelle à travailler de manière isolée, ont souvent tendance à résoudre les problèmes sans nécessairement communiquer en détail leurs démarches. Mon adaptation au monde professionnel a été marquée par la prise de conscience de cette tendance, et j'ai rapidement compris que pour optimiser ma contribution au sein de l'équipe chez Xo7, il était essentiel de surmonter ma réticence à partager pleinement ma méthodologie.</p><p>Cette habitude d'autonomie, bien que bénéfique dans le contexte de l'auto-apprentissage, pouvait créer des situations où mes collègues se sentaient parfois exclus ou mal informés sur l'avancement de mes tâches. Cela a exigé de moi une évolution vers une communication plus ouverte et détaillée, en reconnaissant l'importance de partager mes réflexions et de collaborer activement avec mes pairs. Cette transformation s'est avérée cruciale pour renforcer l'efficacité de mon travail, favoriser une meilleure intégration au sein de l'équipe, et réduire les risques de goulot d'étranglement dans les projets. Elle souligne ainsi l'importance de trouver un équilibre entre l'approche individuelle nécessaire dans le développement informatique et la communication indispensable pour le succès collectif en entreprise.</p>",
            "customCss": {
            }
          }
        ]
      }
    ]
  }
}