{
  "slug": "Mes compétences techniques",
  "title": "Compétences techniques",
  "content": {
    "articles": [
      {
        "title": "Programmation de scripts shell",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Programmation de scripts shell",
          "image": {
            "src": "/img/article-web.png",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>64%, c’est le pourcentage de serveurs dans le monde qui utilisent des variantes de Unix, une famille de système d’exploitation particulièrement connue pour Linux.La programmation de script shell permet d’exécuter des tâches spécifiques à ces environnements.En effet cela permet d’automatiser des tâches manuelles chronophages telle que des sauvegardes de base de données, ou bien de générer des rapports d’évènements systèmes mais aussi d’automatiser le processus de déploiement et de mise à jour d'applications, en garantissant une exécution cohérente et sans erreur à chaque fois. Cela permet de réduire les risques d'erreurs humaines et d'améliorer la disponibilité des applications.De plus, on obtient un contrôle de l’infrastructure, notamment la surveillance des espaces disques, la génération des clés SSH, clés permettant d’être reconnu par un système et d’être autorisé afin de s’y connecter. Dans une infrastructure de clusters kubernetes cela permet de communiquer avec l’API kubernetes pour créer et supprimer des ressources.Enfin ils peuvent être utilisés pour diagnostiquer et résoudre des problèmes d'infrastructure, en automatisant des tâches telles que la collecte de logs, l'analyse des données, et l'exécution de tests de diagnostic. Cela permet de gagner du temps et d'améliorer la précision de la résolution des problèmes.</p>",
            "customCss": {
            }
          }
        ]
      },
      {
        "title": "Déploiement de cluster kubernetes.",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Déploiement de cluster kubernetes.",
          "image": {
            "src": "/img/article-archi-adaptee.jpg",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>Kubernetes, l'orchestrateur de conteneurs de choix pour les applications modernes, permet de gérer des clusters de manière automatisée et scalable. La mise en place d'un cluster Kubernetes peut sembler complexe, mais elle s'avère accessible en suivant une méthodologie rigoureuse. Cet article présente les étapes clés du déploiement d'un cluster Kubernetes, en se concentrant sur les outils et approches les plus populaires.Avant de débuter, il est crucial de disposer d'une infrastructure adéquate, comprenant des machines virtuelles ou physiques dotées d'un système d'exploitation compatible (généralement Linux). Un accès réseau stable et performant est également nécessaire pour la communication entre les nœuds du cluster.Plusieurs options s'offrent pour déployer un cluster Kubernetes, voici celles que j’ai essayé : <li><b>Kubeadm</b>: Solution officielle de Kubernetes, Kubeadm offre une installation simple et intuitive pour les environnements de test ou de petite envergure.</li> <li><b>Docker Desktop</b>: En effet grâce à la conteneurisation de Docker, l’application bureau permet de créer un cluster Kubernetes sur un seul noeud ce qui offre une solution rapide et gratuite. Cependant cette solution n’est pas destinée à un usage professionnel mais pour expérimenter, par exemple en tant qu’étudiant.</li> <li><b>Rancher Kubernetes Engine (RKE)</b>: Plateforme complète pour la gestion de clusters Kubernetes, RKE propose une interface utilisateur intuitive et des fonctionnalités avancées pour la sécurité, la gouvernance et l'observabilité.<li>Le déploiement d’un cluster se déroule de la manière suivante :<li><b>Initialisation du cluster</b>: Cette étape consiste à initialiser le nœud maître du cluster à l'aide de l'outil choisi. Kubeadm, par exemple, permet de créer un fichier de configuration spécifiant les paramètres du cluster.</li><li><b>Ajout de nœuds workers</b>: Les nœuds workers rejoignent le cluster en se connectant au nœud maître et en exécutant les commandes fournies.</li><li><b>Configuration du réseau</b>: Le réseau interne du cluster doit être configuré pour permettre la communication entre les pods et les services. Flannel est une solution réseau populaire pour Kubernetes.</li><li><b>Déploiement d'applications</b>: Une fois le cluster configuré, les applications peuvent être déployées à l'aide de manifestes Kubernetes, qui décrivent les ressources et les configurations nécessaires.</li>Déployer un cluster Kubernetes est en réalité très simple, la complexité se situe plutôt dans la bonne gestion du cluster à long terme.  La mise en place d'un cluster Kubernetes permet de bénéficier des nombreux avantages de cette technologie, tels que l'automatisation du déploiement, la scalabilité et la haute disponibilité des applications.Pour un usage personnel on peut envisager de déployer tout un tas d’application sur son réseau tel qu’un serveur pour héberger et voir ses photos, un blockeur de pub, un Home Assitant pour contrôler sa domotique ou bien même un serveur Minecraft !</p>",
            "customCss": {
            }
          }
        ]
      },
      {
        "title": "Implémenter un logiciel de qualité, en choisissant des structures de données adaptées et des algorithmes pertinents afin d’assurer la robustesse du logiciel.",
        "customCss": {},
        "direction": "row",
        "banner": {
          "headline": "Implémenter un logiciel de qualité, en choisissant des structures de données adaptées et des algorithmes pertinents afin d’assurer la robustesse du logiciel.",
          "image": {
            "src": "/img/article-devlogiciel.jpg",
            "alt": ""
          }
        },
        "elements": [
          {
            "type": "text",
            "content": "<p>Lorsque l'on développe un logiciel, il est essentiel de veiller à ce qu'il soit de qualité, robuste et fiable. Pour ce faire, l'implémentation du logiciel doit être effectuée en choisissant des structures de données adaptées et des algorithmes pertinents. Cette compétence est cruciale pour garantir que le logiciel fonctionne correctement, qu'il est performant et qu'il peut répondre aux besoins des utilisateurs.</p><h1>Qu’est-ce qu’une structure de donnée ?</h1><p>Une structure de donnée est une manière de stocker une information dans la mémoire vive d’un ordinateur dans l’objectif de la traiter plus facilement. Il existe plusieurs structures de données. </p><h2>Les tableaux</h2><p>Le tableau est la structure de donnée la plus courante, et est enseigné dans toutes les écoles pour les débutants. Dans un tableau, chaque élément est indexé, c’est-à-dire qu’on affecte à chaque donnée un numéro permettant au programme d’y accéder. Ensuite, chaque élément est placé de façon contiguë dans la mémoire.<div class='blog-img-wrapper'><img class='blog-img' src='/img/tableau_standard.png'/></div></p><h2>La liste chaînée</h2><p>Une liste chaînée est une structure de donnée permettant de stocker des données de façon linéaire, tout comme le tableau. Une liste est composée de plusieurs nœuds. Chaque nœud stocke une information particulière (un entier, une chaîne de caractères, etc.), ainsi qu’un lien vers un autre nœud.<div class='blog-img-wrapper'><img class='blog-img' src='/img/liste_chainee.png'></div> Il y a plusieurs différences entre un tableau et une liste chaînée. Dans un tableau, on ne peut stocker qu’un seul type de donnée. Par exemple, si l’on souhaite ajouter une nouvelle donnée dans un tableau stockant que des entiers, notre donnée devra obligatoirement être un entier. Dans une liste chaînée, on peut stocker tout type de données (des entiers, des nombres flottants, des chaînes de caractères, des listes, des tableaux, etc.).<br>De plus, dans un tableau traditionnel, chaque élément est stocké côté à côté en mémoire, tandis que dans une liste chaînée, chaque élément est stocké à des endroits libres, sélectionnés par le système d’exploitation.</p><div class='blog-img-wrapper'><img class='blog-img' src='/img/representation_liste_chainee.png'><i>Représentation d'une liste chaînée en mémoire</i></div><br><br><div class='blog-img-wrapper'><img class='blog-img' src='/img/representation_tableau.jpg'><i>Représentation d'un \"array\" (tableau) en mémoire</i></div><br><p>De plus, il est plus simple d’effectuer des opérations d’insertion et de suppression d’élément dans une liste chaînée. Pour supprimer un élément “A” dans une liste, il suffit de parcourir la liste à partir de la tête de liste jusqu’à tomber sur l’élément précédant “A”, puis remplacer le lien partant de l’élément précédant A vers A par un lien vers l’élément situé après A. <br>Dans un tableau traditionnel, une fois l’élément supprimé, on doit décaler tous les éléments le suivant, vers la gauche pour combler le trou crée par la suppression, ce qui demande du travail supplémentaire pour l’ordinateur.</p><h1>Comment mesure-t-on l’efficacité d’un programme informatique ?</h1><p>Un informaticien sera constamment amené à se poser des questions sur l’efficacité de son programme informatique. On pourrait dire que l’efficacité d’un programme informatique se mesure en observant le temps qu’il met à arriver à terme de son exécution. Cependant, cette hypothèse est biaisé.<br>Prenons un exemple concret. <br>Bob, un élève étudiant en première année d'école d’ingénieurs, a pour exercice d’écrire deux programmes informatiques distincts, A et B, qui doivent trier dans l’ordre croissant un tableau traditionnel contenant 10 nombres entiers. Bob doit utiliser deux approches différentes pour trier un tableau d’entiers, d’où le besoin d’écrire deux programmes séparés.<br>A et B trient leur tableau en suivant un algorithme particulier. On part du principe que l’algorithme qu’A va suivre est théoriquement jugé comme moins efficace que l’algorithme que B suit. <br>Bob veut s’assurer que le programme A sera plus lent que le programme B. <br> Bob utilise un chronomètre et effectue plusieurs expérimentations. Il constate qu’à certains essais, A prend plus de temps que B, et dans d’autres cas, B prend plus de temps. Bob ne comprend pas...<br>En effet, il n’est pas viable de mesurer l’efficacité d’un programme informatique à partir du temps qu’il a pris pour arriver à terme, car il y a beaucoup de facteurs qui entrent en compte et viennent biaiser les résultats comme : <br>Les performances du processeur<br>Les échanges chimiques et thermiques se produisant au niveau des circuits électriques qui viennent créer des perturbations<br>Et bien d’autres.. <br>Pour cela, il n’est pas judicieux de mesurer l’efficacité d’un programme informatique par le temps qu'il prend, mais plutôt en quantité d’opérations qu’il va effectuer pendant tout le cycle de vie de ce dernier.<br>Pour résumer toute cette partie, lorsqu'on parle de structures de données adaptées, cela signifie que le choix des structures de données doit être effectué en fonction des besoins du logiciel. De plus, ce choix doit être fait en prenant en compte la quantité des données, ainsi que la variation de la quantité de données qu’on va stocker, si cette quantité est amenée à augmenter au fil du temps ou non.</p><h1>Le choix des algorithmes</h1><p>De même, le choix des algorithmes est tout aussi important. Les algorithmes pertinents doivent être choisis pour garantir que le logiciel fonctionne correctement, qu'il est rapide et efficace. <br>Il est également important de veiller à la robustesse du logiciel. Cela signifie qu'il doit être capable de gérer les erreurs et les exceptions de manière appropriée, de sorte qu'il puisse continuer à fonctionner même en cas d'erreurs ou de pannes. Pour cela, des techniques de gestion des erreurs et de gestion des exceptions doivent être mises en place.<br>En fin de compte, l'implémentation d'un logiciel de qualité nécessite de choisir des structures de données adaptées et des algorithmes pertinents pour garantir la robustesse du logiciel. Cela permet de garantir que le logiciel fonctionne correctement, qu'il est performant et qu'il peut répondre aux besoins des utilisateurs. La compétence pour implémenter un tel logiciel est donc essentielle pour tout développeur de logiciel.</p>",
            "customCss": {
            }
          }
        ]
      }
    ]
  }
}